<?php
/**
 * Created by gai871013.
 * User: @gai871013(Admin)
 * FileName: common.php
 * Date: 2016/8/2
 * Time: 11:34
 *
 *
 * ━━━━━━神兽出没━━━━━━
 *       ┏┓    ┏┓
 *      ┏┛┻━━━━┛┻┓
 *      ┃        ┃
 *      ┃    ━   ┃
 *      ┃  ┳┛ ┗┳ ┃
 *      ┃        ┃
 *      ┃    ┻   ┃
 *      ┃        ┃
 *      ┗━┓    ┏━┛  Code is far away from bug with the animal protecting
 *        ┃    ┃    神兽保佑,代码无bug
 *        ┃    ┃
 *        ┃    ┗━━━┓
 *        ┃        ┣┓
 *        ┃       ┏┛
 *        ┗┓┓┏━┳┓┏┛
 *         ┃┫┫ ┃┫┫
 *         ┗┻┛ ┗┻┛
 *
 * ━━━━━━感觉萌萌哒━━━━━━
 */


return [
    400 => '缺少参数',
    401 => '无权限',
    20000 => '验证通过',
    20001 => '上传成功',
    20002 => '保存成功',
    20003 => '获取成功',
    20004 => '操作完成',
    20005 => '注册成功',
    20006 => '登录成功',
    20007 => '修改成功',
    20008 => '点赞成功',
    20009 => '发送成功',
    20010 => '签到成功',
    20011 => '检测到新版本',
    20012 => '申请成功',
    40001 => ':name不能为空',
    40002 => '用户名(长度:11)或验证码(长度:6)不符合要求',
    40003 => ':name不存在',
    40004 => ':name为空',
    40005 => '请(重新)设置:name',
    40006 => ':name已经存在',
    40007 => '手机号码不正确',
    40008 => '短信验证码模板不存在',
    40009 => '未知短信验证码模板',
    40010 => '验证码发送失败',
    40011 => '短信验证发送成功',
    40012 => '60秒内不能重复获取验证码',
    40013 => '该手机号码未获取验证码',
    40014 => '验证码失效，请重新获取',
    40015 => '验证码不正确',
    40016 => '账号尚未注册',
    40017 => '请求类型不正确',
    40018 => '用户不存在',
    40019 => '手机号码已被占用',
    40020 => '上传失败,图像太大，不超过2M',
    40021 => '未获取到数据',
    40022 => '身份证号不正确',
    40023 => '参数不正确',
    40024 => '参数有冲突(参数不可同时使用)，请检查请求参数',
    40025 => '不可操作',
    40026 => '优惠券已失效',
    40027 => '无权使用该优惠券',
    40028 => '您已领取过该优惠券',
    40029 => '请勿重复提交数据',
    40030 => '订单未完成，不可操作',
    40031 => '无权限查看',
    40032 => '无权限操作',
    40033 => '已授权给其他店铺',
    40034 => '请勿重复:name',
    40035 => '保存失败，距离超过500米',
    40036 => '内容和图片不能同时为空',
    40037 => '没有检测到新版本',
    40038 => '保存失败',
    40039 => '',
    40040 => '未知状态，不可操作',
    40041 => '无权限操作',
    40042 => '有未完成行程',
    40043 => '该状态不可执行此操作',
    40044 => '',
    40045 => '',
    40046 => '',
    40047 => '',
    40048 => '',
    40049 => '',
    40050 => '',
    50001 => '验证码不正确',
    50002 => '用户名与密码不匹配',
    50003 => '未修改',
    50004 => '密码不一致',
    50005 => '缺少类型',
    'code' => '验证码',
    'tel' => '手机号码',
    'name' => '姓名',
    'net' => '宽带账号',
    'template' => '模板',
    'avatar' => '头像',
    'file' => '文件',
    'save_location' => '存储位置',
    'bindUser' => '绑定用户',

];
